neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32G0.c
        return hwDMA_OK;
}

hwDMA_OpResult DMA_NVIC_DeInit(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        DMA_NVIC_Init_Status[channel_index] = false;

        switch(channel_index)
        {
#if defined (STM32G030xx) || defined (STM32G031xx) || defined (STM32G041xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_2] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel2_3_IRQn);
                        }
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_4] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Ch4_5_DMAMUX1_OVR_IRQn);
                        }
                        break;
#endif
#elif defined (STM32G071xx) || defined (STM32G081xx) || defined (STM32G070xx) || \
      defined (STM32G050xx) || defined (STM32G051xx) || defined (STM32G061xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_2] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel2_3_IRQn);
                        }
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
                        {
                                bool dma1_4_7_used = false;

#if defined (DMA1_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_4])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel6)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_6])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel7)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_7])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
                                if (!dma1_4_7_used)
                                {
                                        HAL_NVIC_DisableIRQ(DMA1_Ch4_7_DMAMUX1_OVR_IRQn);
                                }
                        }
                        break;
#endif
#elif defined (STM32G0B0xx) || defined (STM32G0B1xx) || defined (STM32G0C1xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_2] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel2_3_IRQn);
                        }
                        break;
#endif
#if defined (DMA1_BASE)
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
                case hwDMA_Channel_Index_9:
#endif
#if defined (DMA2_Channel2)
                case hwDMA_Channel_Index_10:
#endif
#if defined (DMA2_Channel3)
                case hwDMA_Channel_Index_11:
#endif
#if defined (DMA2_Channel4)
                case hwDMA_Channel_Index_12:
#endif
#if defined (DMA2_Channel5)
                case hwDMA_Channel_Index_13:
#endif
#endif
                        {
                                bool dma1_4_7_dma2_1_5_used = false;

#if defined (DMA1_BASE)
#if defined (DMA1_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_4])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA1_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA1_Channel6)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_6])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA1_Channel7)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_7])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_9])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA2_Channel2)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_10])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA2_Channel3)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_11])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA2_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_12])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA2_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_13])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#endif
                                if (!dma1_4_7_dma2_1_5_used)
                                {
                                        HAL_NVIC_DisableIRQ(DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn);
                                }
                        }
                        break;
#else
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
                        HAL_NVIC_DisableIRQ(DMA1_Channel2_IRQn);
                        break;
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
                        HAL_NVIC_DisableIRQ(DMA1_Channel3_IRQn);
                        break;
#endif
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
                        HAL_NVIC_DisableIRQ(DMA1_Channel4_IRQn);
                        break;
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
                        HAL_NVIC_DisableIRQ(DMA1_Channel5_IRQn);
                        break;
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
                        HAL_NVIC_DisableIRQ(DMA1_Channel6_IRQn);
                        break;
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
                        HAL_NVIC_DisableIRQ(DMA1_Channel7_IRQn);
                        break;
#endif
#endif //DMA1_BASE
#endif
        }

